{ lib, ... }:
let
  lua = lib.generators.mkLuaInline;
in
{
  programs.nvf = {
    settings = {
      vim.dashboard.dashboard-nvim = {
        enable = true;
        setupOpts = {
          theme = "hyper";
          config = {
            header = [
              ""
              "░██       ░██    ░███    ░█████████  ░███████   ░██████████ ░███    ░██ "
              "░██       ░██   ░██░██   ░██     ░██ ░██   ░██  ░██         ░████   ░██ "
              "░██  ░██  ░██  ░██  ░██  ░██     ░██ ░██    ░██ ░██         ░██░██  ░██ "
              "░██ ░████ ░██ ░█████████ ░█████████  ░██    ░██ ░█████████  ░██ ░██ ░██ "
              "░██░██ ░██░██ ░██    ░██ ░██   ░██   ░██    ░██ ░██         ░██  ░██░██ "
              "░████   ░████ ░██    ░██ ░██    ░██  ░██   ░██  ░██         ░██   ░████ "
              "░███     ░███ ░██    ░██ ░██     ░██ ░███████   ░██████████ ░██    ░███ "
              "                                                                        "
              ""
              "                                                                        "
              "                                                                        "
              "   ░███████   ░██████  ░██████  ░██████░██████████   ░███    ░██        "
              "   ░██   ░██    ░██   ░██   ░██   ░██      ░██      ░██░██   ░██        "
              "   ░██    ░██   ░██  ░██          ░██      ░██     ░██  ░██  ░██        "
              "   ░██    ░██   ░██  ░██  █████   ░██      ░██    ░█████████ ░██        "
              "   ░██    ░██   ░██  ░██     ██   ░██      ░██    ░██    ░██ ░██        "
              "   ░██   ░██    ░██   ░██  ░███   ░██      ░██    ░██    ░██ ░██        "
              "   ░███████   ░██████  ░█████░█ ░██████    ░██    ░██    ░██ ░████████  "

              ""
            ];
            shortcut = [
              {
                desc = "󱞁 Neorg";
                group = "@property";
                action = "Neorg index";
                key = "n";
              }
              {
                icon = " ";
                icon_hl = "@variable";
                desc = "Files";
                group = "Label";
                action = ''lua require("snacks.picker").files()'';
                key = "f";
              }
            ];
          };
        };
      };
      vim.ui.noice = {
        enable = true;
        setupOpts = {
          lsp = {
            override = {
              "vim.lsp.util.convert_input_to_markdown_lines" = true;
              "vim.lsp.util.stylize_markdown" = true;
            };
          };
          presets = {
            bottom_search = true;
            command_palette = true;
            long_message_to_split = true;
            inc_rename = false;
            lsp_doc_border = true;
          };
        };
      };
      vim.theme = {
        enable = true;
        name = "catppuccin";
        style = "mocha";
        transparent = true;
      };
      vim.visuals.nvim-web-devicons.enable = true;
      vim.statusline.lualine = {
        enable = true;
        refresh.statusline = 50;
        extraActiveSection.b = [
          ''
            function()
              	local reg = vim.fn.reg_recording()
              	if reg ~= "" then
              		return "Recording @" .. reg
              	else
              	    return ""
              	end
            end
          ''
        ];
      };
    };
  };
}
